#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.main.aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:eu-central-1:991585416715:cluster/ecs-pw-pusher-api-dev]
module.main.data.aws_iam_policy_document.ecs-instance-policy: Reading...
module.main.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0d187be2495c7f79b]
module.main.module.newrelic-aws-cloud-integrations.data.aws_iam_policy_document.newrelic_assume_policy: Reading...
module.main.data.aws_iam_policy_document.ecs_agent: Reading...
module.main.data.aws_iam_policy_document.ecs-instance-policy: Read complete after 0s [id=2851119427]
module.main.aws_ecs_task_definition.task_definition: Refreshing state... [id=pw-pusher-api-dev]
module.main.data.aws_iam_policy_document.ecsInstanceRole-policy: Reading...
module.main.aws_acm_certificate.ssl_certificate: Refreshing state... [id=arn:aws:acm:eu-central-1:991585416715:certificate/5b9eca0d-1016-489e-a4e6-5eff8be14567]
module.main.module.newrelic-aws-cloud-integrations.data.aws_iam_policy_document.newrelic_assume_policy: Read complete after 0s [id=2349971929]
module.main.data.aws_iam_policy_document.ecs_agent: Read complete after 0s [id=2851119427]
module.main.data.aws_iam_policy_document.ecsInstanceRole-policy: Read complete after 0s [id=2851119427]
module.main.aws_sns_topic.account_billing_alarm_topic: Refreshing state... [id=arn:aws:sns:eu-central-1:991585416715:pw-pusher-account-billing-alarm-topic-dev]
module.main.aws_iam_role.ecs_agent: Refreshing state... [id=pw-pusher-api-ecs-agent-dev]
module.main.aws_iam_role_policy_attachment.ecs_agent: Refreshing state... [id=pw-pusher-api-ecs-agent-dev-20230704110845391900000002]
module.main.aws_iam_instance_profile.ecs_agent: Refreshing state... [id=pw-pusher-api-ecs-agent-dev]
module.main.aws_iam_role_policy_attachment.Cloudwatch_FullAccess: Refreshing state... [id=pw-pusher-api-ecs-agent-dev-20230704110845461300000003]
module.main.aws_route53_record.hello_cert_dns: Refreshing state... [id=Z0564497X9NS1YH2WRF5__1d670b3bdc5cb01c828d764eacf488b7.dev.pw-pusher.click._CNAME]
module.main.aws_acm_certificate_validation.cert_validation: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.main.aws_budgets_budget.budget_resources["Amazon Elastic Compute Cloud - Compute"]: Refreshing state... [id=991585416715:pw-pusher dev Amazon Elastic Compute Cloud - Compute Monthly Budget]
module.main.aws_budgets_budget.budget_resources["Amazon Simple Storage Service"]: Refreshing state... [id=991585416715:pw-pusher dev Amazon Simple Storage Service Monthly Budget]
module.main.aws_budgets_budget.budget_resources["Amazon Elastic Load Balancing"]: Refreshing state... [id=991585416715:pw-pusher dev Amazon Elastic Load Balancing Monthly Budget]
module.main.aws_budgets_budget.budget_resources["Amazon Route 53"]: Refreshing state... [id=991585416715:pw-pusher dev Amazon Route 53 Monthly Budget]
module.main.aws_budgets_budget.budget_resources["Amazon EC2 Container Service"]: Refreshing state... [id=991585416715:pw-pusher dev Amazon EC2 Container Service Monthly Budget]
module.main.data.aws_iam_policy_document.sns_topic_policy: Reading...
module.main.aws_budgets_budget.budget_resources["AmazonCloudWatch"]: Refreshing state... [id=991585416715:pw-pusher dev AmazonCloudWatch Monthly Budget]
module.main.data.aws_iam_policy_document.sns_topic_policy: Read complete after 0s [id=1950975549]
module.main.aws_budgets_budget.budget_resources["AWS Key Management Service"]: Refreshing state... [id=991585416715:pw-pusher dev AWS Key Management Service Monthly Budget]
module.main.aws_sns_topic_subscription.billing_alarm_email_subscription: Refreshing state... [id=arn:aws:sns:eu-central-1:991585416715:pw-pusher-account-billing-alarm-topic-dev:10125792-20a3-4bc5-9955-3c4989672e41]
module.main.aws_budgets_budget.budget_account: Refreshing state... [id=991585416715:Account Monthly Budget - pw-pusher dev]
module.main.aws_sns_topic_policy.account_billing_alarm_policy: Refreshing state... [id=arn:aws:sns:eu-central-1:991585416715:pw-pusher-account-billing-alarm-topic-dev]
module.main.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0ba80082038e632b3]
module.main.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-00a1d6b6ee7cc4b62]
module.main.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-07e2f27fdd3d93ae4]
module.main.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-04be19e3df0bbbe9d]
module.main.aws_alb_target_group.alb_public_webservice_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:991585416715:targetgroup/public-pw-pusher-api-tg-dev/2ee5e19884c7708e]
module.main.aws_security_group.ec2: Refreshing state... [id=sg-00907e7cd41433532]
module.main.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-06eeab0878b1230ec]
module.main.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0f42eb5174ffe60e8]
module.main.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0fd834634e50ea99b]
module.main.aws_security_group.public: Refreshing state... [id=sg-019a013d12eb4eaba]
module.main.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-04be19e3df0bbbe9d1080289494]
module.main.aws_security_group_rule.ec2_out: Refreshing state... [id=sgrule-1501248]
module.main.aws_security_group_rule.public_out: Refreshing state... [id=sgrule-807961901]
module.main.aws_security_group_rule.public_in_https: Refreshing state... [id=sgrule-4289847889]
module.main.aws_security_group_rule.public_in_http: Refreshing state... [id=sgrule-155240756]
module.main.aws_security_group_rule.ec2_in_http: Refreshing state... [id=sgrule-2216731582]
module.main.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0dfb9b9561921be95]
module.main.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-05fb72addc4c60614]
module.main.aws_instance.ec2_instance: Refreshing state... [id=i-0a66b3d6aaf79b760]
module.main.aws_lb.loadbalancer: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:991585416715:loadbalancer/app/pw-pusher-api-alb-dev/d0a312728c63103a]
module.main.aws_ecs_service.service-webservice: Refreshing state... [id=arn:aws:ecs:eu-central-1:991585416715:service/ecs-pw-pusher-api-dev/pw-pusher-api-service-dev]
module.main.aws_route53_record.www: Refreshing state... [id=Z0564497X9NS1YH2WRF5_dev.pw-pusher.click_A]
module.main.aws_lb_listener.lb_listener-webservice-https: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:991585416715:listener/app/pw-pusher-api-alb-dev/d0a312728c63103a/da5fc73887cfe8a6]
module.main.aws_lb_listener.lb_listener-webservice-https-redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:991585416715:listener/app/pw-pusher-api-alb-dev/d0a312728c63103a/1ac6bce394cdf83a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.main.aws_ecs_service.service-webservice will be updated in-place
  ~ resource "aws_ecs_service" "service-webservice" {
        id                                 = "arn:aws:ecs:eu-central-1:991585416715:service/ecs-pw-pusher-api-dev/pw-pusher-api-service-dev"
        name                               = "pw-pusher-api-service-dev"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:991585416715:task-definition/pw-pusher-api-dev:18" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.main.aws_ecs_task_definition.task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:991585416715:task-definition/pw-pusher-api-dev:18" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-central-1:991585416715:task-definition/pw-pusher-api-dev" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image            = "ghcr.io/jos1k/passwordpusher-api:sha-6e49a39" -> "ghcr.io/jos1k/passwordpusher-api:sha-d3976f3"
                    name             = "pw-pusher-api-dev"
                    # (11 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "pw-pusher-api-dev" -> (known after apply)
      ~ revision                 = 18 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.main.module.newrelic-aws-cloud-integrations.aws_cloudwatch_metric_stream.newrelic_metric_stream will be created
  + resource "aws_cloudwatch_metric_stream" "newrelic_metric_stream" {
      + arn              = (known after apply)
      + creation_date    = (known after apply)
      + firehose_arn     = (known after apply)
      + id               = (known after apply)
      + last_update_date = (known after apply)
      + name             = "newrelic-metric-stream-pw-pusher-dev"
      + name_prefix      = (known after apply)
      + output_format    = "opentelemetry0.7"
      + role_arn         = (known after apply)
      + state            = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.main.module.newrelic-aws-cloud-integrations.aws_config_configuration_recorder.newrelic_recorder will be created
  + resource "aws_config_configuration_recorder" "newrelic_recorder" {
      + id       = (known after apply)
      + name     = "newrelic_configuration_recorder-pw-pusher-dev"
      + role_arn = (known after apply)
    }

  # module.main.module.newrelic-aws-cloud-integrations.aws_config_configuration_recorder_status.newrelic_recorder_status will be created
  + resource "aws_config_configuration_recorder_status" "newrelic_recorder_status" {
      + id         = (known after apply)
      + is_enabled = true
      + name       = "newrelic_configuration_recorder-pw-pusher-dev"
    }

  # module.main.module.newrelic-aws-cloud-integrations.aws_config_delivery_channel.newrelic_recorder_delivery will be created
  + resource "aws_config_delivery_channel" "newrelic_recorder_delivery" {
      + id             = (known after apply)
      + name           = "newrelic_configuration_recorder-pw-pusher-dev"
      + s3_bucket_name = (known after apply)
    }

  # module.main.module.newrelic-aws-cloud-integrations.aws_iam_policy.newrelic_aws_permissions will be created
  + resource "aws_iam_policy" "newrelic_aws_permissions" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "NewRelicCloudStreamReadPermissions-pw-pusher-dev"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "budgets:ViewBudget",
                          + "cloudtrail:LookupEvents",
                          + "config:BatchGetResourceConfig",
                          + "config:ListDiscoveredResources",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeNatGateways",
                          + "ec2:DescribeVpcEndpoints",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeNetworkAcls",
                          + "ec2:DescribeVpcAttribute",
                          + "ec2:DescribeRouteTables",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeVpnConnections",
                          + "health:DescribeAffectedEntities",
                          + "health:DescribeEventDetails",
                          + "health:DescribeEvents",
                          + "tag:GetResources",
                          + "xray:BatchGet*",
                          + "xray:Get*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.main.module.newrelic-aws-cloud-integrations.aws_iam_role.firehose_newrelic_role will be created
  + resource "aws_iam_role" "firehose_newrelic_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "firehose.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "firehose_newrelic_role_pw-pusher-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.main.module.newrelic-aws-cloud-integrations.aws_iam_role.metric_stream_to_firehose will be created
  + resource "aws_iam_role" "metric_stream_to_firehose" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "streams.metrics.cloudwatch.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "newrelic_metric_stream_to_firehose_role_pw-pusher-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.main.module.newrelic-aws-cloud-integrations.aws_iam_role.newrelic_aws_role will be created
  + resource "aws_iam_role" "newrelic_aws_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + StringEquals = {
                              + "sts:ExternalId" = "4028818"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "754728514883"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "New Relic Cloud integration role"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "NewRelicInfrastructure-Integrations-pw-pusher-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.main.module.newrelic-aws-cloud-integrations.aws_iam_role.newrelic_configuration_recorder will be created
  + resource "aws_iam_role" "newrelic_configuration_recorder" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "config.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "newrelic_configuration_recorder-pw-pusher-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.main.module.newrelic-aws-cloud-integrations.aws_iam_role_policy.metric_stream_to_firehose will be created
  + resource "aws_iam_role_policy" "metric_stream_to_firehose" {
      + id     = (known after apply)
      + name   = "default"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.main.module.newrelic-aws-cloud-integrations.aws_iam_role_policy.newrelic_configuration_recorder_s3 will be created
  + resource "aws_iam_role_policy" "newrelic_configuration_recorder_s3" {
      + id     = (known after apply)
      + name   = "newrelic-configuration-recorder-s3-pw-pusher-dev"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.main.module.newrelic-aws-cloud-integrations.aws_iam_role_policy_attachment.newrelic_aws_policy_attach will be created
  + resource "aws_iam_role_policy_attachment" "newrelic_aws_policy_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "NewRelicInfrastructure-Integrations-pw-pusher-dev"
    }

  # module.main.module.newrelic-aws-cloud-integrations.aws_iam_role_policy_attachment.newrelic_configuration_recorder will be created
  + resource "aws_iam_role_policy_attachment" "newrelic_configuration_recorder" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWS_ConfigRole"
      + role       = "newrelic_configuration_recorder-pw-pusher-dev"
    }

  # module.main.module.newrelic-aws-cloud-integrations.aws_kinesis_firehose_delivery_stream.newrelic_firehose_stream will be created
  + resource "aws_kinesis_firehose_delivery_stream" "newrelic_firehose_stream" {
      + arn            = (known after apply)
      + destination    = "http_endpoint"
      + destination_id = (known after apply)
      + id             = (known after apply)
      + name           = "newrelic_firehose_stream_pw-pusher-dev"
      + tags_all       = (known after apply)
      + version_id     = (known after apply)

      + http_endpoint_configuration {
          + access_key         = (sensitive value)
          + buffering_interval = 60
          + buffering_size     = 1
          + name               = "New Relic pw-pusher-dev"
          + retry_duration     = 300
          + role_arn           = (known after apply)
          + s3_backup_mode     = "FailedDataOnly"
          + url                = "https://aws-api.eu01.nr-data.net/cloudwatch-metrics/v1"

          + request_configuration {
              + content_encoding = "GZIP"
            }

          + s3_configuration {
              + bucket_arn         = (known after apply)
              + buffering_interval = 400
              + buffering_size     = 10
              + compression_format = "GZIP"
              + role_arn           = (known after apply)
            }
        }
    }

  # module.main.module.newrelic-aws-cloud-integrations.aws_s3_bucket.newrelic_aws_bucket will be created
  + resource "aws_s3_bucket" "newrelic_aws_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.main.module.newrelic-aws-cloud-integrations.aws_s3_bucket.newrelic_configuration_recorder_s3 will be created
  + resource "aws_s3_bucket" "newrelic_configuration_recorder_s3" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.main.module.newrelic-aws-cloud-integrations.aws_s3_bucket_ownership_controls.newrelic_ownership_controls will be created
  + resource "aws_s3_bucket_ownership_controls" "newrelic_ownership_controls" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerEnforced"
        }
    }

  # module.main.module.newrelic-aws-cloud-integrations.newrelic_api_access_key.newrelic_aws_access_key will be created
  + resource "newrelic_api_access_key" "newrelic_aws_access_key" {
      + account_id  = 4028818
      + id          = (known after apply)
      + ingest_type = "LICENSE"
      + key         = (sensitive value)
      + key_type    = "INGEST"
      + name        = "Metric Stream Key for pw-pusher-dev"
      + notes       = "AWS Cloud Integrations Metric Stream Key"
      + user_id     = (known after apply)
    }

  # module.main.module.newrelic-aws-cloud-integrations.newrelic_cloud_aws_integrations.newrelic_cloud_integration_pull will be created
  + resource "newrelic_cloud_aws_integrations" "newrelic_cloud_integration_pull" {
      + account_id        = 4028818
      + id                = (known after apply)
      + linked_account_id = (known after apply)

      + alb {}

      + api_gateway {}

      + auto_scaling {}

      + aws_app_sync {}

      + aws_athena {}

      + aws_cognito {}

      + aws_connect {}

      + aws_direct_connect {}

      + aws_fsx {}

      + aws_glue {}

      + aws_kinesis_analytics {}

      + aws_media_convert {}

      + aws_media_package_vod {}

      + aws_mq {}

      + aws_msk {}

      + aws_neptune {}

      + aws_qldb {}

      + aws_route53resolver {}

      + aws_states {}

      + aws_transit_gateway {}

      + aws_waf {}

      + aws_wafv2 {}

      + billing {}

      + cloudfront {}

      + cloudtrail {}

      + doc_db {}

      + dynamodb {}

      + ebs {}

      + ec2 {}

      + ecs {}

      + efs {}

      + elasticache {}

      + elasticbeanstalk {}

      + elasticsearch {}

      + elb {}

      + emr {}

      + health {}

      + iam {}

      + iot {}

      + kinesis {}

      + kinesis_firehose {}

      + lambda {}

      + rds {}

      + redshift {}

      + route53 {}

      + s3 {}

      + ses {}

      + sns {}

      + sqs {}

      + trusted_advisor {}

      + vpc {}

      + x_ray {}
    }

  # module.main.module.newrelic-aws-cloud-integrations.newrelic_cloud_aws_link_account.newrelic_cloud_integration_pull will be created
  + resource "newrelic_cloud_aws_link_account" "newrelic_cloud_integration_pull" {
      + account_id             = 4028818
      + arn                    = (known after apply)
      + id                     = (known after apply)
      + metric_collection_mode = "PULL"
      + name                   = "pw-pusher-dev pull"
    }

  # module.main.module.newrelic-aws-cloud-integrations.newrelic_cloud_aws_link_account.newrelic_cloud_integration_push will be created
  + resource "newrelic_cloud_aws_link_account" "newrelic_cloud_integration_push" {
      + account_id             = 4028818
      + arn                    = (known after apply)
      + id                     = (known after apply)
      + metric_collection_mode = "PUSH"
      + name                   = "pw-pusher-dev metric stream"
    }

  # module.main.module.newrelic-aws-cloud-integrations.random_string.s3-bucket-name will be created
  + resource "random_string" "s3-bucket-name" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 23 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"

```

</details>

*Pusher: @Jos1k, Action: `pull_request`, Working Directory: `infrastructure/dev`, Workflow: `Build and Deploy Dev`*